---
type: DuctFittingAndAccessoryPressureDropItem
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 6
tags: [revit-api, class]
---

# DuctFittingAndAccessoryPressureDropItem

`Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | BeginConnectorIndex | 2014 | `public int BeginConnectorIndex { get ; }` |
| Property | Coefficient | 2014 | `public double Coefficient { get ; set ; }` |
| Property | EndConnectorIndex | 2014 | `public int EndConnectorIndex { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | VelocityPressure | 2014 | `public double VelocityPressure { get ; }` |